terasense/tsapi/usb/STM32/controller/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ID0_Pin GPIO_PIN_13
#define ID0_GPIO_Port GPIOC
#define ID1_Pin GPIO_PIN_14
#define ID1_GPIO_Port GPIOC
#define ID2_Pin GPIO_PIN_15
#define ID2_GPIO_Port GPIOC
#define ADC_RST_Pin GPIO_PIN_1
#define ADC_RST_GPIO_Port GPIOA
#define ADC_nFS_Pin GPIO_PIN_2
#define ADC_nFS_GPIO_Port GPIOA
#define ADC_CONVST_Pin GPIO_PIN_6
#define ADC_CONVST_GPIO_Port GPIOA
#define nHS_Pin GPIO_PIN_4
#define nHS_GPIO_Port GPIOC
#define nAFULL_Pin GPIO_PIN_5
#define nAFULL_GPIO_Port GPIOC
#define nFULL_Pin GPIO_PIN_0
#define nFULL_GPIO_Port GPIOB
#define FX_nRST_Pin GPIO_PIN_1
#define FX_nRST_GPIO_Port GPIOB
#define FX_WIDE_Pin GPIO_PIN_2
#define FX_WIDE_GPIO_Port GPIOB
#define EPM_nCS_Pin GPIO_PIN_12
#define EPM_nCS_GPIO_Port GPIOB
#define DISPL_CS_Pin GPIO_PIN_6
#define DISPL_CS_GPIO_Port GPIOC
#define DISPL_DC_Pin GPIO_PIN_7
#define DISPL_DC_GPIO_Port GPIOC
#define DISPL_RST_Pin GPIO_PIN_8
#define DISPL_RST_GPIO_Port GPIOC
#define GPIO0_Pin GPIO_PIN_9
#define GPIO0_GPIO_Port GPIOA
#define GPIO1_Pin GPIO_PIN_10
#define GPIO1_GPIO_Port GPIOA
#define LED_GREEN_Pin GPIO_PIN_4
#define LED_GREEN_GPIO_Port GPIOB
#define LED_RED_Pin GPIO_PIN_5
#define LED_RED_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
extern SPI_HandleTypeDef hspi1;
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
